Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
extern volatile __CCP7CON1bits_t CCP7CON1bits __asm__ ("CCP7CON1") __attribute__((section("sfrs"), address(0xBF800700)));
extern volatile uint32_t        CCP7CON1CLR __attribute__((section("sfrs"),address(0xBF800704)));
extern volatile uint32_t        CCP7CON1SET __attribute__((section("sfrs"),address(0xBF800708)));
extern volatile uint32_t        CCP7CON1INV __attribute__((section("sfrs"),address(0xBF80070C)));
#define CCP7CON2 CCP7CON2
extern volatile uint32_t   CCP7CON2 __attribute__((section("sfrs"), address(0xBF800710)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP7CON2bits_t;
extern volatile __CCP7CON2bits_t CCP7CON2bits __asm__ ("CCP7CON2") __attribute__((section("sfrs"), address(0xBF800710)));
extern volatile uint32_t        CCP7CON2CLR __attribute__((section("sfrs"),address(0xBF800714)));
extern volatile uint32_t        CCP7CON2SET __attribute__((section("sfrs"),address(0xBF800718)));
extern volatile uint32_t        CCP7CON2INV __attribute__((section("sfrs"),address(0xBF80071C)));
#define CCP7CON3 CCP7CON3
extern volatile uint32_t   CCP7CON3 __attribute__((section("sfrs"), address(0xBF800720)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP7CON3bits_t;
extern volatile __CCP7CON3bits_t CCP7CON3bits __asm__ ("CCP7CON3") __attribute__((section("sfrs"), address(0xBF800720)));
extern volatile uint32_t        CCP7CON3CLR __attribute__((section("sfrs"),address(0xBF800724)));
extern volatile uint32_t        CCP7CON3SET __attribute__((section("sfrs"),address(0xBF800728)));
extern volatile uint32_t        CCP7CON3INV __attribute__((section("sfrs"),address(0xBF80072C)));
#define CCP7STAT CCP7STAT
extern volatile uint32_t   CCP7STAT __attribute__((section("sfrs"), address(0xBF800730)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP7STATbits_t;
extern volatile __CCP7STATbits_t CCP7STATbits __asm__ ("CCP7STAT") __attribute__((section("sfrs"), address(0xBF800730)));
extern volatile uint32_t        CCP7STATCLR __attribute__((section("sfrs"),address(0xBF800734)));
extern volatile uint32_t        CCP7STATSET __attribute__((section("sfrs"),address(0xBF800738)));
extern volatile uint32_t        CCP7STATINV __attribute__((section("sfrs"),address(0xBF80073C)));
#define CCP7TMR CCP7TMR
extern volatile uint32_t   CCP7TMR __attribute__((section("sfrs"), address(0xBF800740)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP7TMRbits_t;
extern volatile __CCP7TMRbits_t CCP7TMRbits __asm__ ("CCP7TMR") __attribute__((section("sfrs"), address(0xBF800740)));
extern volatile uint32_t        CCP7TMRCLR __attribute__((section("sfrs"),address(0xBF800744)));
extern volatile uint32_t        CCP7TMRSET __attribute__((section("sfrs"),address(0xBF800748)));
extern volatile uint32_t        CCP7TMRINV __attribute__((section("sfrs"),address(0xBF80074C)));
#define CCP7PR CCP7PR
extern volatile uint32_t   CCP7PR __attribute__((section("sfrs"), address(0xBF800750)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP7PRbits_t;
extern volatile __CCP7PRbits_t CCP7PRbits __asm__ ("CCP7PR") __attribute__((section("sfrs"), address(0xBF800750)));
extern volatile uint32_t        CCP7PRCLR __attribute__((section("sfrs"),address(0xBF800754)));
extern volatile uint32_t        CCP7PRSET __attribute__((section("sfrs"),address(0xBF800758)));
extern volatile uint32_t        CCP7PRINV __attribute__((section("sfrs"),address(0xBF80075C)));
#define CCP7RA CCP7RA
extern volatile uint32_t   CCP7RA __attribute__((section("sfrs"), address(0xBF800760)));
typedef struct {
  uint32_t CMPA:16;
} __CCP7RAbits_t;
extern volatile __CCP7RAbits_t CCP7RAbits __asm__ ("CCP7RA") __attribute__((section("sfrs"), address(0xBF800760)));
extern volatile uint32_t        CCP7RACLR __attribute__((section("sfrs"),address(0xBF800764)));
extern volatile uint32_t        CCP7RASET __attribute__((section("sfrs"),address(0xBF800768)));
extern volatile uint32_t        CCP7RAINV __attribute__((section("sfrs"),address(0xBF80076C)));
#define CCP7RB CCP7RB
extern volatile uint32_t   CCP7RB __attribute__((section("sfrs"), address(0xBF800770)));
typedef struct {
  uint32_t CMPB:16;
} __CCP7RBbits_t;
extern volatile __CCP7RBbits_t CCP7RBbits __asm__ ("CCP7RB") __attribute__((section("sfrs"), address(0xBF800770)));
extern volatile uint32_t        CCP7RBCLR __attribute__((section("sfrs"),address(0xBF800774)));
extern volatile uint32_t        CCP7RBSET __attribute__((section("sfrs"),address(0xBF800778)));
extern volatile uint32_t        CCP7RBINV __attribute__((section("sfrs"),address(0xBF80077C)));
#define CCP7BUF CCP7BUF
extern volatile uint32_t   CCP7BUF __attribute__((section("sfrs"), address(0xBF800780)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP7BUFbits_t;
extern volatile __CCP7BUFbits_t CCP7BUFbits __asm__ ("CCP7BUF") __attribute__((section("sfrs"), address(0xBF800780)));
extern volatile uint32_t        CCP7BUFCLR __attribute__((section("sfrs"),address(0xBF800784)));
extern volatile uint32_t        CCP7BUFSET __attribute__((section("sfrs"),address(0xBF800788)));
extern volatile uint32_t        CCP7BUFINV __attribute__((section("sfrs"),address(0xBF80078C)));
#define CCP8CON1 CCP8CON1
extern volatile uint32_t   CCP8CON1 __attribute__((section("sfrs"), address(0xBF800800)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP8CON1bits_t;
extern volatile __CCP8CON1bits_t CCP8CON1bits __asm__ ("CCP8CON1") __attribute__((section("sfrs"), address(0xBF800800)));
extern volatile uint32_t        CCP8CON1CLR __attribute__((section("sfrs"),address(0xBF800804)));
extern volatile uint32_t        CCP8CON1SET __attribute__((section("sfrs"),address(0xBF800808)));
extern volatile uint32_t        CCP8CON1INV __attribute__((section("sfrs"),address(0xBF80080C)));
#define CCP8CON2 CCP8CON2
extern volatile uint32_t   CCP8CON2 __attribute__((section("sfrs"), address(0xBF800810)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t :6;
  uint32_t OENSYNC:1;
} __CCP8CON2bits_t;
extern volatile __CCP8CON2bits_t CCP8CON2bits __asm__ ("CCP8CON2") __attribute__((section("sfrs"), address(0xBF800810)));
extern volatile uint32_t        CCP8CON2CLR __attribute__((section("sfrs"),address(0xBF800814)));
extern volatile uint32_t        CCP8CON2SET __attribute__((section("sfrs"),address(0xBF800818)));
extern volatile uint32_t        CCP8CON2INV __attribute__((section("sfrs"),address(0xBF80081C)));
#define CCP8CON3 CCP8CON3
extern volatile uint32_t   CCP8CON3 __attribute__((section("sfrs"), address(0xBF800820)));
typedef struct {
  uint32_t :18;
  uint32_t PSSACE:2;
  uint32_t :1;
  uint32_t POLACE:1;
  uint32_t :6;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP8CON3bits_t;
extern volatile __CCP8CON3bits_t CCP8CON3bits __asm__ ("CCP8CON3") __attribute__((section("sfrs"), address(0xBF800820)));
extern volatile uint32_t        CCP8CON3CLR __attribute__((section("sfrs"),address(0xBF800824)));
extern volatile uint32_t        CCP8CON3SET __attribute__((section("sfrs"),address(0xBF800828)));
extern volatile uint32_t        CCP8CON3INV __attribute__((section("sfrs"),address(0xBF80082C)));
#define CCP8STAT CCP8STAT
extern volatile uint32_t   CCP8STAT __attribute__((section("sfrs"), address(0xBF800830)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP8STATbits_t;
