Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
extern volatile __U3STAbits_t U3STAbits __asm__ ("U3STA") __attribute__((section("sfrs"), address(0xBF802010)));
extern volatile uint32_t        U3STACLR __attribute__((section("sfrs"),address(0xBF802014)));
extern volatile uint32_t        U3STASET __attribute__((section("sfrs"),address(0xBF802018)));
extern volatile uint32_t        U3STAINV __attribute__((section("sfrs"),address(0xBF80201C)));
#define U3TXREG U3TXREG
extern volatile uint32_t   U3TXREG __attribute__((section("sfrs"), address(0xBF802020)));
#define U3RXREG U3RXREG
extern volatile uint32_t   U3RXREG __attribute__((section("sfrs"), address(0xBF802030)));
#define U3BRG U3BRG
extern volatile uint32_t   U3BRG __attribute__((section("sfrs"), address(0xBF802040)));
typedef struct {
  uint32_t BRG:20;
} __U3BRGbits_t;
extern volatile __U3BRGbits_t U3BRGbits __asm__ ("U3BRG") __attribute__((section("sfrs"), address(0xBF802040)));
extern volatile uint32_t        U3BRGCLR __attribute__((section("sfrs"),address(0xBF802044)));
extern volatile uint32_t        U3BRGSET __attribute__((section("sfrs"),address(0xBF802048)));
extern volatile uint32_t        U3BRGINV __attribute__((section("sfrs"),address(0xBF80204C)));
#define ADC1BUF0 ADC1BUF0
extern volatile uint32_t   ADC1BUF0 __attribute__((section("sfrs"), address(0xBF802100)));
extern volatile uint32_t        ADC1BUF0CLR __attribute__((section("sfrs"),address(0xBF802104)));
extern volatile uint32_t        ADC1BUF0SET __attribute__((section("sfrs"),address(0xBF802108)));
extern volatile uint32_t        ADC1BUF0INV __attribute__((section("sfrs"),address(0xBF80210C)));
#define ADC1BUF1 ADC1BUF1
extern volatile uint32_t   ADC1BUF1 __attribute__((section("sfrs"), address(0xBF802110)));
extern volatile uint32_t        ADC1BUF1CLR __attribute__((section("sfrs"),address(0xBF802114)));
extern volatile uint32_t        ADC1BUF1SET __attribute__((section("sfrs"),address(0xBF802118)));
extern volatile uint32_t        ADC1BUF1INV __attribute__((section("sfrs"),address(0xBF80211C)));
#define ADC1BUF2 ADC1BUF2
extern volatile uint32_t   ADC1BUF2 __attribute__((section("sfrs"), address(0xBF802120)));
extern volatile uint32_t        ADC1BUF2CLR __attribute__((section("sfrs"),address(0xBF802124)));
extern volatile uint32_t        ADC1BUF2SET __attribute__((section("sfrs"),address(0xBF802128)));
extern volatile uint32_t        ADC1BUF2INV __attribute__((section("sfrs"),address(0xBF80212C)));
#define ADC1BUF3 ADC1BUF3
extern volatile uint32_t   ADC1BUF3 __attribute__((section("sfrs"), address(0xBF802130)));
extern volatile uint32_t        ADC1BUF3CLR __attribute__((section("sfrs"),address(0xBF802134)));
extern volatile uint32_t        ADC1BUF3SET __attribute__((section("sfrs"),address(0xBF802138)));
extern volatile uint32_t        ADC1BUF3INV __attribute__((section("sfrs"),address(0xBF80213C)));
#define ADC1BUF4 ADC1BUF4
extern volatile uint32_t   ADC1BUF4 __attribute__((section("sfrs"), address(0xBF802140)));
extern volatile uint32_t        ADC1BUF4CLR __attribute__((section("sfrs"),address(0xBF802144)));
extern volatile uint32_t        ADC1BUF4SET __attribute__((section("sfrs"),address(0xBF802148)));
extern volatile uint32_t        ADC1BUF4INV __attribute__((section("sfrs"),address(0xBF80214C)));
#define ADC1BUF5 ADC1BUF5
extern volatile uint32_t   ADC1BUF5 __attribute__((section("sfrs"), address(0xBF802150)));
extern volatile uint32_t        ADC1BUF5CLR __attribute__((section("sfrs"),address(0xBF802154)));
extern volatile uint32_t        ADC1BUF5SET __attribute__((section("sfrs"),address(0xBF802158)));
extern volatile uint32_t        ADC1BUF5INV __attribute__((section("sfrs"),address(0xBF80215C)));
#define ADC1BUF6 ADC1BUF6
extern volatile uint32_t   ADC1BUF6 __attribute__((section("sfrs"), address(0xBF802160)));
extern volatile uint32_t        ADC1BUF6CLR __attribute__((section("sfrs"),address(0xBF802164)));
extern volatile uint32_t        ADC1BUF6SET __attribute__((section("sfrs"),address(0xBF802168)));
extern volatile uint32_t        ADC1BUF6INV __attribute__((section("sfrs"),address(0xBF80216C)));
#define ADC1BUF7 ADC1BUF7
extern volatile uint32_t   ADC1BUF7 __attribute__((section("sfrs"), address(0xBF802170)));
extern volatile uint32_t        ADC1BUF7CLR __attribute__((section("sfrs"),address(0xBF802174)));
extern volatile uint32_t        ADC1BUF7SET __attribute__((section("sfrs"),address(0xBF802178)));
extern volatile uint32_t        ADC1BUF7INV __attribute__((section("sfrs"),address(0xBF80217C)));
#define ADC1BUF8 ADC1BUF8
extern volatile uint32_t   ADC1BUF8 __attribute__((section("sfrs"), address(0xBF802180)));
extern volatile uint32_t        ADC1BUF8CLR __attribute__((section("sfrs"),address(0xBF802184)));
extern volatile uint32_t        ADC1BUF8SET __attribute__((section("sfrs"),address(0xBF802188)));
extern volatile uint32_t        ADC1BUF8INV __attribute__((section("sfrs"),address(0xBF80218C)));
#define ADC1BUF9 ADC1BUF9
extern volatile uint32_t   ADC1BUF9 __attribute__((section("sfrs"), address(0xBF802190)));
extern volatile uint32_t        ADC1BUF9CLR __attribute__((section("sfrs"),address(0xBF802194)));
extern volatile uint32_t        ADC1BUF9SET __attribute__((section("sfrs"),address(0xBF802198)));
extern volatile uint32_t        ADC1BUF9INV __attribute__((section("sfrs"),address(0xBF80219C)));
#define ADC1BUF10 ADC1BUF10
extern volatile uint32_t   ADC1BUF10 __attribute__((section("sfrs"), address(0xBF8021A0)));
extern volatile uint32_t        ADC1BUF10CLR __attribute__((section("sfrs"),address(0xBF8021A4)));
extern volatile uint32_t        ADC1BUF10SET __attribute__((section("sfrs"),address(0xBF8021A8)));
extern volatile uint32_t        ADC1BUF10INV __attribute__((section("sfrs"),address(0xBF8021AC)));
#define ADC1BUF11 ADC1BUF11
extern volatile uint32_t   ADC1BUF11 __attribute__((section("sfrs"), address(0xBF8021B0)));
extern volatile uint32_t        ADC1BUF11CLR __attribute__((section("sfrs"),address(0xBF8021B4)));
extern volatile uint32_t        ADC1BUF11SET __attribute__((section("sfrs"),address(0xBF8021B8)));
extern volatile uint32_t        ADC1BUF11INV __attribute__((section("sfrs"),address(0xBF8021BC)));
#define ADC1BUF12 ADC1BUF12
extern volatile uint32_t   ADC1BUF12 __attribute__((section("sfrs"), address(0xBF8021C0)));
extern volatile uint32_t        ADC1BUF12CLR __attribute__((section("sfrs"),address(0xBF8021C4)));
extern volatile uint32_t        ADC1BUF12SET __attribute__((section("sfrs"),address(0xBF8021C8)));
extern volatile uint32_t        ADC1BUF12INV __attribute__((section("sfrs"),address(0xBF8021CC)));
#define ADC1BUF13 ADC1BUF13
extern volatile uint32_t   ADC1BUF13 __attribute__((section("sfrs"), address(0xBF8021D0)));
extern volatile uint32_t        ADC1BUF13CLR __attribute__((section("sfrs"),address(0xBF8021D4)));
extern volatile uint32_t        ADC1BUF13SET __attribute__((section("sfrs"),address(0xBF8021D8)));
extern volatile uint32_t        ADC1BUF13INV __attribute__((section("sfrs"),address(0xBF8021DC)));
#define ADC1BUF14 ADC1BUF14
extern volatile uint32_t   ADC1BUF14 __attribute__((section("sfrs"), address(0xBF8021E0)));
extern volatile uint32_t        ADC1BUF14CLR __attribute__((section("sfrs"),address(0xBF8021E4)));
extern volatile uint32_t        ADC1BUF14SET __attribute__((section("sfrs"),address(0xBF8021E8)));
extern volatile uint32_t        ADC1BUF14INV __attribute__((section("sfrs"),address(0xBF8021EC)));
#define ADC1BUF15 ADC1BUF15
extern volatile uint32_t   ADC1BUF15 __attribute__((section("sfrs"), address(0xBF8021F0)));
extern volatile uint32_t        ADC1BUF15CLR __attribute__((section("sfrs"),address(0xBF8021F4)));
extern volatile uint32_t        ADC1BUF15SET __attribute__((section("sfrs"),address(0xBF8021F8)));
extern volatile uint32_t        ADC1BUF15INV __attribute__((section("sfrs"),address(0xBF8021FC)));
#define ADC1BUF16 ADC1BUF16
extern volatile uint32_t   ADC1BUF16 __attribute__((section("sfrs"), address(0xBF802200)));
extern volatile uint32_t        ADC1BUF16CLR __attribute__((section("sfrs"),address(0xBF802204)));
extern volatile uint32_t        ADC1BUF16SET __attribute__((section("sfrs"),address(0xBF802208)));
extern volatile uint32_t        ADC1BUF16INV __attribute__((section("sfrs"),address(0xBF80220C)));
#define ADC1BUF17 ADC1BUF17
extern volatile uint32_t   ADC1BUF17 __attribute__((section("sfrs"), address(0xBF802210)));
extern volatile uint32_t        ADC1BUF17CLR __attribute__((section("sfrs"),address(0xBF802214)));
extern volatile uint32_t        ADC1BUF17SET __attribute__((section("sfrs"),address(0xBF802218)));
extern volatile uint32_t        ADC1BUF17INV __attribute__((section("sfrs"),address(0xBF80221C)));
#define ADC1BUF18 ADC1BUF18
extern volatile uint32_t   ADC1BUF18 __attribute__((section("sfrs"), address(0xBF802220)));
extern volatile uint32_t        ADC1BUF18CLR __attribute__((section("sfrs"),address(0xBF802224)));
extern volatile uint32_t        ADC1BUF18SET __attribute__((section("sfrs"),address(0xBF802228)));
extern volatile uint32_t        ADC1BUF18INV __attribute__((section("sfrs"),address(0xBF80222C)));
#define ADC1BUF19 ADC1BUF19
extern volatile uint32_t   ADC1BUF19 __attribute__((section("sfrs"), address(0xBF802230)));
extern volatile uint32_t        ADC1BUF19CLR __attribute__((section("sfrs"),address(0xBF802234)));
extern volatile uint32_t        ADC1BUF19SET __attribute__((section("sfrs"),address(0xBF802238)));
extern volatile uint32_t        ADC1BUF19INV __attribute__((section("sfrs"),address(0xBF80223C)));
#define ADC1BUF20 ADC1BUF20
extern volatile uint32_t   ADC1BUF20 __attribute__((section("sfrs"), address(0xBF802240)));
extern volatile uint32_t        ADC1BUF20CLR __attribute__((section("sfrs"),address(0xBF802244)));
extern volatile uint32_t        ADC1BUF20SET __attribute__((section("sfrs"),address(0xBF802248)));
extern volatile uint32_t        ADC1BUF20INV __attribute__((section("sfrs"),address(0xBF80224C)));
#define ADC1BUF21 ADC1BUF21
extern volatile uint32_t   ADC1BUF21 __attribute__((section("sfrs"), address(0xBF802250)));
extern volatile uint32_t        ADC1BUF21CLR __attribute__((section("sfrs"),address(0xBF802254)));
extern volatile uint32_t        ADC1BUF21SET __attribute__((section("sfrs"),address(0xBF802258)));
extern volatile uint32_t        ADC1BUF21INV __attribute__((section("sfrs"),address(0xBF80225C)));
#define AD1CON1 AD1CON1
extern volatile uint32_t   AD1CON1 __attribute__((section("sfrs"), address(0xBF802260)));
typedef struct {
  uint32_t DONE:1;
  uint32_t SAMP:1;
  uint32_t ASAM:1;
  uint32_t MODE12:1;
  uint32_t SSRC:4;
  uint32_t FORM:3;
  uint32_t :2;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
} __AD1CON1bits_t;
