Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF802BB0)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF802BB4)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF802BB8)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF802BBC)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF802BC0)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t TRISA2:1;
    uint32_t TRISA3:1;
    uint32_t TRISA4:1;
    uint32_t TRISA5:1;
    uint32_t TRISA6:1;
    uint32_t TRISA7:1;
    uint32_t TRISA8:1;
    uint32_t TRISA9:1;
    uint32_t TRISA10:1;
    uint32_t :4;
    uint32_t TRISA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF802BC0)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF802BC4)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF802BC8)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF802BCC)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF802BD0)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t RA2:1;
    uint32_t RA3:1;
    uint32_t RA4:1;
    uint32_t RA5:1;
    uint32_t RA6:1;
    uint32_t RA7:1;
    uint32_t RA8:1;
    uint32_t RA9:1;
    uint32_t RA10:1;
    uint32_t :4;
    uint32_t RA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF802BD0)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF802BD4)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF802BD8)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF802BDC)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF802BE0)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t LATA2:1;
    uint32_t LATA3:1;
    uint32_t LATA4:1;
    uint32_t LATA5:1;
    uint32_t LATA6:1;
    uint32_t LATA7:1;
    uint32_t LATA8:1;
    uint32_t LATA9:1;
    uint32_t LATA10:1;
    uint32_t :4;
    uint32_t LATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF802BE0)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF802BE4)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF802BE8)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF802BEC)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF802BF0)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t ODCA2:1;
    uint32_t ODCA3:1;
    uint32_t ODCA4:1;
    uint32_t ODCA5:1;
    uint32_t ODCA6:1;
    uint32_t ODCA7:1;
    uint32_t ODCA8:1;
    uint32_t ODCA9:1;
    uint32_t ODCA10:1;
    uint32_t :4;
    uint32_t ODCA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF802BF0)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF802BF4)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF802BF8)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF802BFC)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF802C00)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t CNPUA2:1;
    uint32_t CNPUA3:1;
    uint32_t CNPUA4:1;
    uint32_t CNPUA5:1;
    uint32_t CNPUA6:1;
    uint32_t CNPUA7:1;
    uint32_t CNPUA8:1;
    uint32_t CNPUA9:1;
    uint32_t CNPUA10:1;
    uint32_t :4;
    uint32_t CNPUA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF802C00)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF802C04)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF802C08)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF802C0C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF802C10)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t CNPDA2:1;
    uint32_t CNPDA3:1;
    uint32_t CNPDA4:1;
    uint32_t CNPDA5:1;
    uint32_t CNPDA6:1;
    uint32_t CNPDA7:1;
    uint32_t CNPDA8:1;
    uint32_t CNPD9:1;
    uint32_t CNPDA10:1;
    uint32_t :4;
    uint32_t CNPDA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF802C10)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF802C14)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF802C18)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF802C1C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF802C20)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t PORT32:1;
    uint32_t CNSTYLE:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF802C20)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF802C24)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF802C28)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF802C2C)));
#define CNEN0A CNEN0A
extern volatile uint32_t   CNEN0A __attribute__((section("sfrs"), address(0xBF802C30)));
typedef union {
  struct {
    uint32_t CNIE0A0:1;
    uint32_t CNIE0A1:1;
    uint32_t CNIE0A2:1;
    uint32_t CNIE0A3:1;
    uint32_t CNIE0A4:1;
    uint32_t CNIE0A5:1;
    uint32_t CNIE0A6:1;
    uint32_t CNIE0A7:1;
    uint32_t CNIE0A8:1;
    uint32_t CNIE0A9:1;
    uint32_t CNIE0A10:1;
    uint32_t :4;
    uint32_t CNIE0A15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN0Abits_t;
extern volatile __CNEN0Abits_t CNEN0Abits __asm__ ("CNEN0A") __attribute__((section("sfrs"), address(0xBF802C30)));
extern volatile uint32_t        CNEN0ACLR __attribute__((section("sfrs"),address(0xBF802C34)));
extern volatile uint32_t        CNEN0ASET __attribute__((section("sfrs"),address(0xBF802C38)));
extern volatile uint32_t        CNEN0AINV __attribute__((section("sfrs"),address(0xBF802C3C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF802C40)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t CNSTATA2:1;
    uint32_t CNSTATA3:1;
    uint32_t CNSTATA4:1;
    uint32_t CNSTATA5:1;
    uint32_t CNSTATA6:1;
    uint32_t CNSTATA7:1;
    uint32_t CNSTATA8:1;
    uint32_t CNSTATA9:1;
    uint32_t CNSTATA10:1;
    uint32_t :4;
    uint32_t CNSTATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF802C40)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF802C44)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF802C48)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF802C4C)));
#define CNEN1A CNEN1A
extern volatile uint32_t   CNEN1A __attribute__((section("sfrs"), address(0xBF802C50)));
typedef union {
  struct {
    uint32_t CNIE1A0:1;
    uint32_t CNIE1A1:1;
    uint32_t CNIE1A2:1;
    uint32_t CNIE1A3:1;
    uint32_t CNIE1A4:1;
    uint32_t CNIE1A5:1;
    uint32_t CNIE1A6:1;
    uint32_t CNIE1A7:1;
    uint32_t CNIE1A8:1;
    uint32_t CNIE1A9:1;
    uint32_t CNIE1A10:1;
    uint32_t :4;
    uint32_t CNIE1A15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN1Abits_t;
extern volatile __CNEN1Abits_t CNEN1Abits __asm__ ("CNEN1A") __attribute__((section("sfrs"), address(0xBF802C50)));
extern volatile uint32_t        CNEN1ACLR __attribute__((section("sfrs"),address(0xBF802C54)));
extern volatile uint32_t        CNEN1ASET __attribute__((section("sfrs"),address(0xBF802C58)));
extern volatile uint32_t        CNEN1AINV __attribute__((section("sfrs"),address(0xBF802C5C)));
#define CNFA CNFA
extern volatile uint32_t   CNFA __attribute__((section("sfrs"), address(0xBF802C60)));
typedef union {
  struct {
    uint32_t CNFA0:1;
    uint32_t CNFA1:1;
    uint32_t CNFA2:1;
    uint32_t CNFA3:1;
    uint32_t CNFA4:1;
    uint32_t CNFA5:1;
    uint32_t CNFA6:1;
    uint32_t CNFA7:1;
    uint32_t CNFA8:1;
    uint32_t CNFA9:1;
    uint32_t CNFA10:1;
    uint32_t :4;
    uint32_t CNFA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNFAbits_t;
extern volatile __CNFAbits_t CNFAbits __asm__ ("CNFA") __attribute__((section("sfrs"), address(0xBF802C60)));
extern volatile uint32_t        CNFACLR __attribute__((section("sfrs"),address(0xBF802C64)));
extern volatile uint32_t        CNFASET __attribute__((section("sfrs"),address(0xBF802C68)));
extern volatile uint32_t        CNFAINV __attribute__((section("sfrs"),address(0xBF802C6C)));
#define SR0A SR0A
extern volatile uint32_t   SR0A __attribute__((section("sfrs"), address(0xBF802C70)));
typedef struct {
  uint32_t w:32;
} __SR0Abits_t;
extern volatile __SR0Abits_t SR0Abits __asm__ ("SR0A") __attribute__((section("sfrs"), address(0xBF802C70)));
extern volatile uint32_t        SR0ACLR __attribute__((section("sfrs"),address(0xBF802C74)));
extern volatile uint32_t        SR0ASET __attribute__((section("sfrs"),address(0xBF802C78)));
extern volatile uint32_t        SR0AINV __attribute__((section("sfrs"),address(0xBF802C7C)));
#define SR1A SR1A
extern volatile uint32_t   SR1A __attribute__((section("sfrs"), address(0xBF802C80)));
typedef struct {
  uint32_t w:32;
} __SR1Abits_t;
extern volatile __SR1Abits_t SR1Abits __asm__ ("SR1A") __attribute__((section("sfrs"), address(0xBF802C80)));
extern volatile uint32_t        SR1ACLR __attribute__((section("sfrs"),address(0xBF802C84)));
extern volatile uint32_t        SR1ASET __attribute__((section("sfrs"),address(0xBF802C88)));
extern volatile uint32_t        SR1AINV __attribute__((section("sfrs"),address(0xBF802C8C)));
#define ANSELB ANSELB
extern volatile uint32_t   ANSELB __attribute__((section("sfrs"), address(0xBF802CB0)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t :8;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
    uint32_t ANSB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs"), address(0xBF802CB0)));
#define B B
extern volatile uint32_t   B __attribute__((section("sfrs"), address(0xBF802CB0)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t :8;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
    uint32_t ANSB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __Bbits_t;
