Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
  .extern IPC6             /* 0xBF80F1A0 */
  .extern IPC6CLR          /* 0xBF80F1A4 */
  .extern IPC6SET          /* 0xBF80F1A8 */
  .extern IPC6INV          /* 0xBF80F1AC */
  .extern IPC7             /* 0xBF80F1B0 */
  .extern IPC7CLR          /* 0xBF80F1B4 */
  .extern IPC7SET          /* 0xBF80F1B8 */
  .extern IPC7INV          /* 0xBF80F1BC */
  .extern IPC8             /* 0xBF80F1C0 */
  .extern IPC8CLR          /* 0xBF80F1C4 */
  .extern IPC8SET          /* 0xBF80F1C8 */
  .extern IPC8INV          /* 0xBF80F1CC */
  .extern IPC9             /* 0xBF80F1D0 */
  .extern IPC9CLR          /* 0xBF80F1D4 */
  .extern IPC9SET          /* 0xBF80F1D8 */
  .extern IPC9INV          /* 0xBF80F1DC */
  .extern IPC10            /* 0xBF80F1E0 */
  .extern IPC10CLR         /* 0xBF80F1E4 */
  .extern IPC10SET         /* 0xBF80F1E8 */
  .extern IPC10INV         /* 0xBF80F1EC */
  .extern IPC11            /* 0xBF80F1F0 */
  .extern IPC11CLR         /* 0xBF80F1F4 */
  .extern IPC11SET         /* 0xBF80F1F8 */
  .extern IPC11INV         /* 0xBF80F1FC */
  .extern IPC12            /* 0xBF80F200 */
  .extern IPC12CLR         /* 0xBF80F204 */
  .extern IPC12SET         /* 0xBF80F208 */
  .extern IPC12INV         /* 0xBF80F20C */
  .extern IPC13            /* 0xBF80F210 */
  .extern IPC13CLR         /* 0xBF80F214 */
  .extern IPC13SET         /* 0xBF80F218 */
  .extern IPC13INV         /* 0xBF80F21C */
  .extern IPC14            /* 0xBF80F220 */
  .extern IPC14CLR         /* 0xBF80F224 */
  .extern IPC14SET         /* 0xBF80F228 */
  .extern IPC14INV         /* 0xBF80F22C */
  .extern IPC15            /* 0xBF80F230 */
  .extern IPC15CLR         /* 0xBF80F234 */
  .extern IPC15SET         /* 0xBF80F238 */
  .extern IPC15INV         /* 0xBF80F23C */
  .extern IPC16            /* 0xBF80F240 */
  .extern IPC16CLR         /* 0xBF80F244 */
  .extern IPC16SET         /* 0xBF80F248 */
  .extern IPC16INV         /* 0xBF80F24C */
  .extern IPC17            /* 0xBF80F250 */
  .extern IPC17CLR         /* 0xBF80F254 */
  .extern IPC17SET         /* 0xBF80F258 */
  .extern IPC17INV         /* 0xBF80F25C */
  .extern IPC18            /* 0xBF80F260 */
  .extern IPC18CLR         /* 0xBF80F264 */
  .extern IPC18SET         /* 0xBF80F268 */
  .extern IPC18INV         /* 0xBF80F26C */
  .extern IPC19            /* 0xBF80F270 */
  .extern IPC19CLR         /* 0xBF80F274 */
  .extern IPC19SET         /* 0xBF80F278 */
  .extern IPC19INV         /* 0xBF80F27C */
  .extern IPC20            /* 0xBF80F280 */
  .extern IPC20CLR         /* 0xBF80F284 */
  .extern IPC20SET         /* 0xBF80F288 */
  .extern IPC20INV         /* 0xBF80F28C */
  .extern IPC21            /* 0xBF80F290 */
  .extern IPC21CLR         /* 0xBF80F294 */
  .extern IPC21SET         /* 0xBF80F298 */
  .extern IPC21INV         /* 0xBF80F29C */
  .extern IPC22            /* 0xBF80F2A0 */
  .extern IPC22CLR         /* 0xBF80F2A4 */
  .extern IPC22SET         /* 0xBF80F2A8 */
  .extern IPC22INV         /* 0xBF80F2AC */
  .extern IPC23            /* 0xBF80F2B0 */
  .extern IPC23CLR         /* 0xBF80F2B4 */
  .extern IPC23SET         /* 0xBF80F2B8 */
  .extern IPC23INV         /* 0xBF80F2BC */
  .extern IPC24            /* 0xBF80F2C0 */
  .extern IPC24CLR         /* 0xBF80F2C4 */
  .extern IPC24SET         /* 0xBF80F2C8 */
  .extern IPC24INV         /* 0xBF80F2CC */
  .extern IPC25            /* 0xBF80F2D0 */
  .extern IPC25CLR         /* 0xBF80F2D4 */
  .extern IPC25SET         /* 0xBF80F2D8 */
  .extern IPC25INV         /* 0xBF80F2DC */
  .extern UDID1            /* 0xBFC41840 */
  .extern UDID2            /* 0xBFC41844 */
  .extern UDID3            /* 0xBFC41848 */
  .extern UDID4            /* 0xBFC4184C */
  .extern UDID5            /* 0xBFC41850 */
  .extern FDEVOPT          /* 0xBFC017C4 */
  .extern FICD             /* 0xBFC017C8 */
  .extern FPOR             /* 0xBFC017CC */
  .extern FWDT             /* 0xBFC017D0 */
  .extern FOSCSEL          /* 0xBFC017D4 */
  .extern FSEC             /* 0xBFC017D8 */
  .extern AFDEVOPT         /* 0xBFC01744 */
  .extern AFICD            /* 0xBFC01748 */
  .extern AFPOR            /* 0xBFC0174C */
  .extern AFWDT            /* 0xBFC01750 */
  .extern AFOSCSEL         /* 0xBFC01754 */
  .extern AFSEC            /* 0xBFC01758 */
#else
#error Unknown language!
#endif

#define _RTCCON1_OUTSEL_POSITION                 0x00000004
#define _RTCCON1_OUTSEL_MASK                     0x00000070
#define _RTCCON1_OUTSEL_LENGTH                   0x00000003

#define _RTCCON1_RTCOE_POSITION                  0x00000007
#define _RTCCON1_RTCOE_MASK                      0x00000080
#define _RTCCON1_RTCOE_LENGTH                    0x00000001

#define _RTCCON1_WRLOCK_POSITION                 0x0000000B
#define _RTCCON1_WRLOCK_MASK                     0x00000800
#define _RTCCON1_WRLOCK_LENGTH                   0x00000001

#define _RTCCON1_ON_POSITION                     0x0000000F
#define _RTCCON1_ON_MASK                         0x00008000
#define _RTCCON1_ON_LENGTH                       0x00000001

#define _RTCCON1_ALMRPT_POSITION                 0x00000010
#define _RTCCON1_ALMRPT_MASK                     0x00FF0000
#define _RTCCON1_ALMRPT_LENGTH                   0x00000008

#define _RTCCON1_AMASK_POSITION                  0x00000018
#define _RTCCON1_AMASK_MASK                      0x0F000000
#define _RTCCON1_AMASK_LENGTH                    0x00000004

#define _RTCCON1_CHIME_POSITION                  0x0000001E
#define _RTCCON1_CHIME_MASK                      0x40000000
#define _RTCCON1_CHIME_LENGTH                    0x00000001

#define _RTCCON1_ALRMEN_POSITION                 0x0000001F
#define _RTCCON1_ALRMEN_MASK                     0x80000000
#define _RTCCON1_ALRMEN_LENGTH                   0x00000001

#define _RTCCON2_CLKSEL_POSITION                 0x00000000
#define _RTCCON2_CLKSEL_MASK                     0x00000003
#define _RTCCON2_CLKSEL_LENGTH                   0x00000002

#define _RTCCON2_FDIV_POSITION                   0x0000000B
#define _RTCCON2_FDIV_MASK                       0x0000F800
#define _RTCCON2_FDIV_LENGTH                     0x00000005

