Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
#define _CNEN0C_CNIE0C5_POSITION                 0x00000005
#define _CNEN0C_CNIE0C5_MASK                     0x00000020
#define _CNEN0C_CNIE0C5_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C6_POSITION                 0x00000006
#define _CNEN0C_CNIE0C6_MASK                     0x00000040
#define _CNEN0C_CNIE0C6_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C7_POSITION                 0x00000007
#define _CNEN0C_CNIE0C7_MASK                     0x00000080
#define _CNEN0C_CNIE0C7_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C8_POSITION                 0x00000008
#define _CNEN0C_CNIE0C8_MASK                     0x00000100
#define _CNEN0C_CNIE0C8_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C9_POSITION                 0x00000009
#define _CNEN0C_CNIE0C9_MASK                     0x00000200
#define _CNEN0C_CNIE0C9_LENGTH                   0x00000001

#define _CNEN0C_CNIE0C12_POSITION                0x0000000C
#define _CNEN0C_CNIE0C12_MASK                    0x00001000
#define _CNEN0C_CNIE0C12_LENGTH                  0x00000001

#define _CNEN0C_w_POSITION                       0x00000000
#define _CNEN0C_w_MASK                           0xFFFFFFFF
#define _CNEN0C_w_LENGTH                         0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC4_POSITION               0x00000004
#define _CNSTATC_CNSTATC4_MASK                   0x00000010
#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC5_POSITION               0x00000005
#define _CNSTATC_CNSTATC5_MASK                   0x00000020
#define _CNSTATC_CNSTATC5_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _CNEN1C_CNIE1C0_POSITION                 0x00000000
#define _CNEN1C_CNIE1C0_MASK                     0x00000001
#define _CNEN1C_CNIE1C0_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C1_POSITION                 0x00000001
#define _CNEN1C_CNIE1C1_MASK                     0x00000002
#define _CNEN1C_CNIE1C1_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C2_POSITION                 0x00000002
#define _CNEN1C_CNIE1C2_MASK                     0x00000004
#define _CNEN1C_CNIE1C2_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C3_POSITION                 0x00000003
#define _CNEN1C_CNIE1C3_MASK                     0x00000008
#define _CNEN1C_CNIE1C3_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C4_POSITION                 0x00000004
#define _CNEN1C_CNIE1C4_MASK                     0x00000010
#define _CNEN1C_CNIE1C4_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C5_POSITION                 0x00000005
#define _CNEN1C_CNIE1C5_MASK                     0x00000020
#define _CNEN1C_CNIE1C5_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C6_POSITION                 0x00000006
#define _CNEN1C_CNIE1C6_MASK                     0x00000040
#define _CNEN1C_CNIE1C6_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C7_POSITION                 0x00000007
#define _CNEN1C_CNIE1C7_MASK                     0x00000080
#define _CNEN1C_CNIE1C7_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C8_POSITION                 0x00000008
#define _CNEN1C_CNIE1C8_MASK                     0x00000100
#define _CNEN1C_CNIE1C8_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C9_POSITION                 0x00000009
#define _CNEN1C_CNIE1C9_MASK                     0x00000200
#define _CNEN1C_CNIE1C9_LENGTH                   0x00000001

#define _CNEN1C_CNIE1C12_POSITION                0x0000000C
#define _CNEN1C_CNIE1C12_MASK                    0x00001000
#define _CNEN1C_CNIE1C12_LENGTH                  0x00000001

#define _CNEN1C_w_POSITION                       0x00000000
#define _CNEN1C_w_MASK                           0xFFFFFFFF
#define _CNEN1C_w_LENGTH                         0x00000020

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC4_POSITION                     0x00000004
#define _CNFC_CNFC4_MASK                         0x00000010
#define _CNFC_CNFC4_LENGTH                       0x00000001

#define _CNFC_CNFC5_POSITION                     0x00000005
#define _CNFC_CNFC5_MASK                         0x00000020
#define _CNFC_CNFC5_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

