Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_w_POSITION                         0x00000000
#define _CNFC_w_MASK                             0xFFFFFFFF
#define _CNFC_w_LENGTH                           0x00000020

#define _SR0C_w_POSITION                         0x00000000
#define _SR0C_w_MASK                             0xFFFFFFFF
#define _SR0C_w_LENGTH                           0x00000020

#define _SR1C_w_POSITION                         0x00000000
#define _SR1C_w_MASK                             0xFFFFFFFF
#define _SR1C_w_LENGTH                           0x00000020

#define _ANSELD_w_POSITION                       0x00000000
#define _ANSELD_w_MASK                           0xFFFFFFFF
#define _ANSELD_w_LENGTH                         0x00000020

#define _TRISD_TRISD0_POSITION                   0x00000000
#define _TRISD_TRISD0_MASK                       0x00000001
#define _TRISD_TRISD0_LENGTH                     0x00000001

#define _TRISD_w_POSITION                        0x00000000
#define _TRISD_w_MASK                            0xFFFFFFFF
#define _TRISD_w_LENGTH                          0x00000020

#define _PORTD_RD0_POSITION                      0x00000000
#define _PORTD_RD0_MASK                          0x00000001
#define _PORTD_RD0_LENGTH                        0x00000001

#define _PORTD_w_POSITION                        0x00000000
#define _PORTD_w_MASK                            0xFFFFFFFF
#define _PORTD_w_LENGTH                          0x00000020

#define _LATD_LATD0_POSITION                     0x00000000
#define _LATD_LATD0_MASK                         0x00000001
#define _LATD_LATD0_LENGTH                       0x00000001

#define _LATD_w_POSITION                         0x00000000
#define _LATD_w_MASK                             0xFFFFFFFF
#define _LATD_w_LENGTH                           0x00000020

#define _ODCD_ODCD0_POSITION                     0x00000000
#define _ODCD_ODCD0_MASK                         0x00000001
#define _ODCD_ODCD0_LENGTH                       0x00000001

#define _ODCD_w_POSITION                         0x00000000
#define _ODCD_w_MASK                             0xFFFFFFFF
#define _ODCD_w_LENGTH                           0x00000020

#define _CNPUD_CNPUD0_POSITION                   0x00000000
#define _CNPUD_CNPUD0_MASK                       0x00000001
#define _CNPUD_CNPUD0_LENGTH                     0x00000001

#define _CNPUD_w_POSITION                        0x00000000
#define _CNPUD_w_MASK                            0xFFFFFFFF
#define _CNPUD_w_LENGTH                          0x00000020

#define _CNPDD_CNPDD0_POSITION                   0x00000000
#define _CNPDD_CNPDD0_MASK                       0x00000001
#define _CNPDD_CNPDD0_LENGTH                     0x00000001

#define _CNPDD_w_POSITION                        0x00000000
#define _CNPDD_w_MASK                            0xFFFFFFFF
#define _CNPDD_w_LENGTH                          0x00000020

#define _CNCOND_PORT32_POSITION                  0x0000000A
#define _CNCOND_PORT32_MASK                      0x00000400
#define _CNCOND_PORT32_LENGTH                    0x00000001

#define _CNCOND_CNSTYLE_POSITION                 0x0000000B
#define _CNCOND_CNSTYLE_MASK                     0x00000800
#define _CNCOND_CNSTYLE_LENGTH                   0x00000001

#define _CNCOND_ON_POSITION                      0x0000000F
#define _CNCOND_ON_MASK                          0x00008000
#define _CNCOND_ON_LENGTH                        0x00000001

#define _CNCOND_w_POSITION                       0x00000000
#define _CNCOND_w_MASK                           0xFFFFFFFF
#define _CNCOND_w_LENGTH                         0x00000020

#define _CNEN0D_CNIE0D0_POSITION                 0x00000000
#define _CNEN0D_CNIE0D0_MASK                     0x00000001
#define _CNEN0D_CNIE0D0_LENGTH                   0x00000001

#define _CNEN0D_w_POSITION                       0x00000000
#define _CNEN0D_w_MASK                           0xFFFFFFFF
#define _CNEN0D_w_LENGTH                         0x00000020

#define _CNSTATD_CNSTATD0_POSITION               0x00000000
#define _CNSTATD_CNSTATD0_MASK                   0x00000001
#define _CNSTATD_CNSTATD0_LENGTH                 0x00000001

#define _CNSTATD_w_POSITION                      0x00000000
#define _CNSTATD_w_MASK                          0xFFFFFFFF
#define _CNSTATD_w_LENGTH                        0x00000020

#define _CNEN1D_CNIE1D0_POSITION                 0x00000000
#define _CNEN1D_CNIE1D0_MASK                     0x00000001
#define _CNEN1D_CNIE1D0_LENGTH                   0x00000001

#define _CNEN1D_w_POSITION                       0x00000000
#define _CNEN1D_w_MASK                           0xFFFFFFFF
#define _CNEN1D_w_LENGTH                         0x00000020

#define _CNFD_CNFD0_POSITION                     0x00000000
#define _CNFD_CNFD0_MASK                         0x00000001
#define _CNFD_CNFD0_LENGTH                       0x00000001

#define _CNFD_w_POSITION                         0x00000000
#define _CNFD_w_MASK                             0xFFFFFFFF
#define _CNFD_w_LENGTH                           0x00000020

#define _SR0D_w_POSITION                         0x00000000
#define _SR0D_w_MASK                             0xFFFFFFFF
#define _SR0D_w_LENGTH                           0x00000020

#define _SR1D_w_POSITION                         0x00000000
#define _SR1D_w_MASK                             0xFFFFFFFF
#define _SR1D_w_LENGTH                           0x00000020

#define _PMDCON_PMDLOCK_POSITION                 0x0000000B
#define _PMDCON_PMDLOCK_MASK                     0x00000800
#define _PMDCON_PMDLOCK_LENGTH                   0x00000001

