Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0256gpm048.h
#define _PMD1_ADCMD_POSITION                     0x00000000
#define _PMD1_ADCMD_MASK                         0x00000001
#define _PMD1_ADCMD_LENGTH                       0x00000001

#define _PMD1_VREFMD_POSITION                    0x0000000C
#define _PMD1_VREFMD_MASK                        0x00001000
#define _PMD1_VREFMD_LENGTH                      0x00000001

#define _PMD1_HLVDMD_POSITION                    0x00000014
#define _PMD1_HLVDMD_MASK                        0x00100000
#define _PMD1_HLVDMD_LENGTH                      0x00000001

#define _PMD2_CMP1MD_POSITION                    0x00000000
#define _PMD2_CMP1MD_MASK                        0x00000001
#define _PMD2_CMP1MD_LENGTH                      0x00000001

#define _PMD2_CMP2MD_POSITION                    0x00000001
#define _PMD2_CMP2MD_MASK                        0x00000002
#define _PMD2_CMP2MD_LENGTH                      0x00000001

#define _PMD2_CMP3MD_POSITION                    0x00000002
#define _PMD2_CMP3MD_MASK                        0x00000004
#define _PMD2_CMP3MD_LENGTH                      0x00000001

#define _PMD2_CLC1MD_POSITION                    0x00000018
#define _PMD2_CLC1MD_MASK                        0x01000000
#define _PMD2_CLC1MD_LENGTH                      0x00000001

#define _PMD2_CLC2MD_POSITION                    0x00000019
#define _PMD2_CLC2MD_MASK                        0x02000000
#define _PMD2_CLC2MD_LENGTH                      0x00000001

#define _PMD2_CLC3MD_POSITION                    0x0000001A
#define _PMD2_CLC3MD_MASK                        0x04000000
#define _PMD2_CLC3MD_LENGTH                      0x00000001

#define _PMD2_CLC4MD_POSITION                    0x0000001B
#define _PMD2_CLC4MD_MASK                        0x08000000
#define _PMD2_CLC4MD_LENGTH                      0x00000001

#define _PMD3_CCP1MD_POSITION                    0x00000008
#define _PMD3_CCP1MD_MASK                        0x00000100
#define _PMD3_CCP1MD_LENGTH                      0x00000001

#define _PMD3_CCP2MD_POSITION                    0x00000009
#define _PMD3_CCP2MD_MASK                        0x00000200
#define _PMD3_CCP2MD_LENGTH                      0x00000001

#define _PMD3_CCP3MD_POSITION                    0x0000000A
#define _PMD3_CCP3MD_MASK                        0x00000400
#define _PMD3_CCP3MD_LENGTH                      0x00000001

#define _PMD3_CCP4MD_POSITION                    0x0000000B
#define _PMD3_CCP4MD_MASK                        0x00000800
#define _PMD3_CCP4MD_LENGTH                      0x00000001

#define _PMD3_CC5MD_POSITION                     0x0000000C
#define _PMD3_CC5MD_MASK                         0x00001000
#define _PMD3_CC5MD_LENGTH                       0x00000001

#define _PMD3_CC6MD_POSITION                     0x0000000D
#define _PMD3_CC6MD_MASK                         0x00002000
#define _PMD3_CC6MD_LENGTH                       0x00000001

#define _PMD3_CC7MD_POSITION                     0x0000000E
#define _PMD3_CC7MD_MASK                         0x00004000
#define _PMD3_CC7MD_LENGTH                       0x00000001

#define _PMD3_CC8MD_POSITION                     0x0000000F
#define _PMD3_CC8MD_MASK                         0x00008000
#define _PMD3_CC8MD_LENGTH                       0x00000001

#define _PMD3_CC9MD_POSITION                     0x00000010
#define _PMD3_CC9MD_MASK                         0x00010000
#define _PMD3_CC9MD_LENGTH                       0x00000001

#define _PMD4_T1MD_POSITION                      0x00000000
#define _PMD4_T1MD_MASK                          0x00000001
#define _PMD4_T1MD_LENGTH                        0x00000001

#define _PMD4_T2MD_POSITION                      0x00000001
#define _PMD4_T2MD_MASK                          0x00000002
#define _PMD4_T2MD_LENGTH                        0x00000001

#define _PMD4_T3MD_POSITION                      0x00000002
#define _PMD4_T3MD_MASK                          0x00000004
#define _PMD4_T3MD_LENGTH                        0x00000001

#define _PMD5_U1MD_POSITION                      0x00000000
#define _PMD5_U1MD_MASK                          0x00000001
#define _PMD5_U1MD_LENGTH                        0x00000001

#define _PMD5_U2MD_POSITION                      0x00000001
#define _PMD5_U2MD_MASK                          0x00000002
#define _PMD5_U2MD_LENGTH                        0x00000001

#define _PMD5_U3MD_POSITION                      0x00000002
#define _PMD5_U3MD_MASK                          0x00000004
#define _PMD5_U3MD_LENGTH                        0x00000001

#define _PMD5_SPI1MD_POSITION                    0x00000008
#define _PMD5_SPI1MD_MASK                        0x00000100
#define _PMD5_SPI1MD_LENGTH                      0x00000001

#define _PMD5_SPI2MD_POSITION                    0x00000009
#define _PMD5_SPI2MD_MASK                        0x00000200
#define _PMD5_SPI2MD_LENGTH                      0x00000001

#define _PMD5_SPI3MD_POSITION                    0x0000000A
#define _PMD5_SPI3MD_MASK                        0x00000400
#define _PMD5_SPI3MD_LENGTH                      0x00000001

#define _PMD5_I2C1MD_POSITION                    0x00000010
#define _PMD5_I2C1MD_MASK                        0x00010000
#define _PMD5_I2C1MD_LENGTH                      0x00000001

#define _PMD5_I2C2MD_POSITION                    0x00000011
#define _PMD5_I2C2MD_MASK                        0x00020000
#define _PMD5_I2C2MD_LENGTH                      0x00000001

#define _PMD5_I2C3MD_POSITION                    0x00000012
#define _PMD5_I2C3MD_MASK                        0x00040000
#define _PMD5_I2C3MD_LENGTH                      0x00000001

#define _PMD5_USBMD_POSITION                     0x00000018
#define _PMD5_USBMD_MASK                         0x01000000
#define _PMD5_USBMD_LENGTH                       0x00000001

#define _PMD6_RTCCMD_POSITION                    0x00000000
#define _PMD6_RTCCMD_MASK                        0x00000001
#define _PMD6_RTCCMD_LENGTH                      0x00000001

#define _PMD6_REFOMD_POSITION                    0x00000008
#define _PMD6_REFOMD_MASK                        0x00000100
#define _PMD6_REFOMD_LENGTH                      0x00000001

